// вивести прості числа які діляться або на одиницю
// const min = 1;
// const max = 24;

// nextIteration;
// for (i = min; i <= max; i += 1; j +=1) {
//   for (j = 2; j <= i) {
//     if (i % j === 0) {
//       continue nextIteration;
//      }
  
//   }
//     console.log(i);
// }
// **************************************************
// При завантаженні сторінки користувачеві пропонується
// в prompt ввести число. Введення додається до значення
// змінної total.
// Операція введення числа продовжується доти,
// поки користувач не натисне кнопку Cancel в prompt.
// Після того як користувач припинив введення, натиснувши на
// кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// 1 Зробити перевірку, що користувач ввів саме число,
// а не довільний набір символів.

//  let answerUser;
// let total = 0;

// while (true) {
//   answerUser = prompt('Input number');
//   //   console.log(answerUser);
//   total += Number(answerUser);
//   if (answerUser === null) {
//     break;
//   }
// }

// console.log(total);
// **************************************************
// Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз і так далі.
// Цикл повинен запитувати число, поки користувач не
// введе число більше 100, або натисне кнопку
// Скасування в prompt

// while (true) {
//   answerUser = prompt(`Input number`);
//   if (!(answerUser < 100)) {
//     break;
//   }
// }

// За кожен місяць податкова нараховує на ЗП розробника 5% від суми.
// Напишіть консольну функцію, в яку користувач вводить суму зп
// і кількість місяців з допомогою prompt()
// не забуваємо, що промпт повертає рядок.
// А податкова обчислює кінцеву суму зп без податків,
// Суму податків всього і чистий дохід розробника за кожен місяць.
// Для обчислення суми з урахуванням відсотків використовуйте цикл for.



// const sallary = Number(prompt("Введіть суму зарплати за 1 місяць"));
// const months = Number(prompt("Введіть кількість місяців"));
// let taxes = 0;
// let totalSallary = 0;

// for (i = 1; i <= months; i += 1) {
//   taxes += sallary * 0.05;
//   totalSallary += sallary * 0.95;
// }

// console.log(
//   "Загальна сума отриманої зарплати: ",
//   totalSallary,
//   "Загальна сума податків: ",
//   taxes
// );

